import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion";
import { Button } from "./ui/button";
import { ArrowUpRight } from "lucide-react";

export const FAQs = () => {
  return (
    <div className="flex flex-col justify-between p-2">
      <Accordion type="single" collapsible className="w-full">
        <AccordionItem value="item-1">
          <AccordionTrigger>Системд хэрхэн бүртгүүлэх бэ?</AccordionTrigger>
          <AccordionContent className="space-y-2">
            <p>Баруун дээд хэсэгт – Бүртгүүлэх/Нийлүүлэгч</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Байгууллагын регистрийн дугаар оруулах, өөр газар фокуслах
                Анхаарах зүйлс: – Байгуулага системд бүртгэлтэй байвал мэдээлэл
                автоматаар бөглөгдөж гарч ирнэ, – Үгүй тохиолдолд мэдээллийг та
                өөрөө бөглөнө
              </li>
              <li>
                * – оор тэмдэглэсэн хэсгийг заавал бөглөнө, Өргөдөл хэсэгт
                материалыг *.pdf файлын төрөлтэй хавсаргаж илгээнэ
              </li>
              <li>
                Өргөдөл ажлын 3 өдөрт батлагдах бөгөөд амжилттай үед хариу
                бүртгүүлсэн цахим хуудсанд ирэх бөгөөд холбоос хэсгээр орж
                баталгаажуулна
              </li>
              <li>
                Бүртгүүлэх өргөдлийн Хариуцсан ажилтны хэсэгт бөглөсөн
                Хэрэглэгчийн нэр, нууц үгийг ашиглан нэвтэрнэ.
              </li>
            </ul>
          </AccordionContent>
        </AccordionItem>
        <AccordionItem value="item-2">
          <AccordionTrigger>Цахим гарын үсэг хэрхэн авах бэ?</AccordionTrigger>
          <AccordionContent className="space-y-2">
            <p>
              Цахим гарын үсгийн тухай хууль батлагдсанаар аж ахуйн нэгжүүдэд
              цахим гарын үсэг тараагдаж эхэлсэн. Олгож байгаа байгууллагууд:
            </p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Монпасс ХХК нь тусгай зөвшөөрөл эзэмшдэг эрх бүхий компани
                бөгөөд www.monpass.mn цахим хуудаснаас дэлгэрэнгүй мэдээллийг
                авна уу
              </li>
              <li>
                Төрийн өмчийн бодлого зохицуулалтын газар, жич: www.monpass.mn
                цахим хуудсаар дамжин гэрээний төсөл авчирсан, төлбөр хураамжийг
                төлсөн этгээдэд
              </li>
              <li>
                Дүнжингарав худалдан төвд байрлах “Нийслэлийн нэгдсэн
                үйлчилгээний төв”
              </li>
              <li>Орон нутагт – Орон нутгийн өмчийн газрууд</li>
            </ul>
          </AccordionContent>
        </AccordionItem>
        <AccordionItem value="item-3">
          <AccordionTrigger>Хэрхэн тендерт оролцогч болох вэ?</AccordionTrigger>
          <AccordionContent className="space-y-2">
            <ul className="list-decimal list-inside space-y-2">
              <li>Хэрэглэгчийн эрхээр нэвтэрч орно.</li>
              <li>
                Баруун дээд буланд байрлах байгууллагын нэр дээр дарж үндсэн
                цэсрүү орно.
              </li>
              <li>
                Үндсэн цэснээс тендер шалгаруулалт {">"} боломжит тш-н жагсаалт
                руу орж оролцохоор сонирхсон тендерийн хураамжыг голомт банкны
                и-мерчантын системээр төлнө.
              </li>
              <li>
                Төлбөр амжилттай төлөгдсөн тохиолдолд үндсэн цэсийн тш {">"}{" "}
                оролцож буй тш-н жагсаалтад орж ирнэ.
              </li>
            </ul>
            <p>Анхаарах зүйл:</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Гүйлгээ хийх карт нь интернэт гүйлгээ хийх эрхтэй байх ёстой
                бөгөөд эрхээ нээгээгүй тохиолдолд харилцах банкандаа хандаж
                нээлгэнэ.
              </li>
              <li>
                Хэрэв цахим тендер шалгаруулалтад оролцож байгаа бол зөвхөн
                дээрх байдлаар төлбөрөө хийх бөгөөд захиалагч, захиалагч
                байгууллагын дансанд тушаахгүй гэдгийг анхаарна уу.
              </li>
              <li>
                Цахим тендерийн хувьд тендерийн баримт бичиг худалдан авах гэсэн
                ойлголт байхгүй бөгөөд tender.gov.mn системийн нүүр хуудсанд
                байрлах тендерийн урилга хэсгээс тухайн тендер шалгаруулалттай
                холбоотой баримт бичгийг үнэгүй татаж үзэх боломжтой.
              </li>
            </ul>
          </AccordionContent>
        </AccordionItem>
        <AccordionItem value="item-4">
          <AccordionTrigger>
            Хэрхэн тендерийн баталгаа гаргах вэ?
          </AccordionTrigger>
          <AccordionContent className="space-y-2">
            <p>
              Цахим тендерийн баталгаа гаргахад дараах шаардлагыг хангасан байх
              ёстой.
            </p>
            <p>Үүнд:</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Тендерийн баталгаа гаргахын тулд тухайн тендерийн хураамжыг төлж
                тендерт оролцогч болсон байх.
              </li>
              <li>Багцтай тендерийн хувьд оролцох багцаа идэвхижүүлсэн байх</li>
            </ul>
            <p>Анхаарах зүйлс:</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Цахим тендерийн баталгаа гаргахдаа tender.gov.mn систем дээрх
                урилгын дугаарыг харилцах банканд өгөх.
              </li>
              <li>
                Урилгын дугаарыг үндсэн цэсийн тендер шалгаруулалт {">"} оролцож
                буй тш-с харах боломжтой.
              </li>
              <li>
                Банкнаас цахим тендерийн баталгааг гаргасан эсэийг тендер
                шалгаруулалт {">"} оролцож буй тш –ын “Баталгаа ” товч дээр дарж
                шалгах боломжтой.
              </li>
            </ul>
          </AccordionContent>
        </AccordionItem>
        <AccordionItem value="item-5">
          <AccordionTrigger>Тендерийн материал илгээх</AccordionTrigger>
          <AccordionContent className="space-y-2">
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Үндсэн цэсийн тендер шалгаруулалт {">"} оролцож буй тш цэсээс
                материал илгээх гэж буй тендерийн урилгын дугаар дээр дарж орон
                техникийн санал хэсэгт илгээр материалаа (*.pdf) форматаар нэг
                файлын хэмжээ 15mb, нийт файлын хэмжээ 100mb-с хэтрэхгүй байхаар
                бэлтгэж хавсарна,санхүүгийн санал хэсэгт санал болгож буй үнийн
                дүн болон бусад мэдээллийг бөглөж хадгална.
              </li>
              <li>
                Зөвлөх үйлчлгээний тендер шалгаруулалтын хувьд санхүүгийн
                саналын материалыг санхүүгийн санал хэсэгт хавсаргана.
              </li>
              <li>
                Техникийн санал, Санхүүгийн санал , Баталгааны мэдээлэл бүрэн
                эсэхийг шалгаж үзсэний дараа “Материал илгээх ” товчийг дарж
                илгээнэ.
              </li>
            </ul>
            <p>Анхаарах зүйл:</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Тендер хүлээн авах эцсийн хугацаа дуусахаас өмнө илгээсэн
                материалаа шинэчлэн дахин илгээх боломжтой бөгөөд “Материал
                засах” товчийг дарж тоон гарын үсгийн нууц үгийг оруулснаар
                материалаа шинэчлэх боломжтой болно.
              </li>
              <li>
                Материал шинэчилсний дараа дахин “Материал илгээх” товчийг дарж
                илгээнэ.
              </li>
            </ul>
          </AccordionContent>
        </AccordionItem>
        <AccordionItem value="item-6">
          <AccordionTrigger>Тендерийн баталгаа цуцлах</AccordionTrigger>
          <AccordionContent className="space-y-2">
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Тендерийн баталгаа цуцлахын тул баталгаа цуцлах хүсэлтийг
                цахимаар гаргана.
              </li>
              <li>
                Үндсэн цэсийн Тендер шалгаруулалт {">"} Тендерийн баталгаа
                хэсгээс тендерээ сонгон “Баталгаа цуцлах” товчийг дарснаар
                цуцлуулах хүсэлтээ гаргана.
              </li>
            </ul>
            <p>Анхаарах зүйл:</p>
            <ul className="list-decimal list-inside space-y-2">
              <li>
                Уг гаргасан захиалагчын байгууллага цахимаар зөвшөөрсний
                дараагаар банк баталгааг цуцлах боломжтой болно.
              </li>
              <li>
                Цахимаар гаргасан хүсэлтийг цуцалсан хэдий ч банкнаас албан
                бичиг шаардсан тохиолдолд Нийслэлийн худалдан авах ажиллагааны
                газарт хаяглан хүсэлт өгч албан бичиг авна.
              </li>
            </ul>
          </AccordionContent>
        </AccordionItem>
      </Accordion>
      <Button className="bg-[#24276B] cursor-pointer">
        2025 Оны төлөвлөгөө <ArrowUpRight />
      </Button>
    </div>
  );
};
